<template>
    <div>
        <div class="container-body">
            <div>
                <div style="font-size:24px;text-align: center;margin-bottom:10px;">租伴网入驻协议</div>
                <div style="text-indent:2em;">为使用租伴及服务，你应当阅读并遵守《租伴许可及服务协议》（以下筒称"本协议”），请你务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。限制、免责条款可能以加粗形式提示你注意。除非你已阅读并接受本协议所有条款，否则，你使用本平台及相关服务时，你的注册、使用、发布信息、登录等行为即视为你已阅读并同意上述协议的约束。如果你未满18周岁，请在法定监护人的陪同下阅读本协议及其他上述协议，并特别注意未成年人使用条款。</div>
                <div><b>一、 协议的范围</b>
                    <br/> 1. 本协议是你与本平台之间关于你注册、上传信息、使用、以及使用租伴平台相关服务所订立的协议。</div>
                <div><b>二、 关于本服务</b>
                    <br/> 2.1 本服务的内容 本服务内容是指租伴向用户提供的信息平台，支持出租自己、包租别人、在线支付等服务内容（以下简称本服务）。
                    <br/> 2.2 本服务的形式
                    <br/> 2.2.1 租伴给予你一项个人的、不可转让及非排他性的许可。通过平台登录或者微信账号登录。你仅可为访问或使用本服务的目的而使用这些服务。
                    <br/> 2.2.2 本条及本协议其他条款未明示授权的其他一切权利仍由租伴保留，你在行使这些权利时须另外取得租伴的书面许可。租伴如果未行使前述任何权利，并不构成对该权利的放弃。</div>
                <div><b>三、用户个人信息保护</b>
                    <br/> 3.1 保护用户个人信息是租伴的一项基本原则，租伴将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可租伴不会向第三方公开、透露用户个人信息。租伴对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。
                    <br/>3.2 你在注册帐号或使用本服务的过程中，需要提供一些必要的信息，例如：为向你提供帐号注册服务或进行用户身份识别，需要你填写手机号码；微信号码；微信二维码等。若国家法律法规或政策有特殊规定的，你需要提供真实的身份信息。若你提供的信息不完整，则无法使用本服务或在使用过程中受到限制。
                    <br/>3.3 —般情况下，你可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如申诉服务）的考虑，你可能无法修改注册时提供的初始注册信息及其他验证信息。
                    <br/>3.4 租伴将运用各种安全技术和程序建立完善的管理制度来保护你的个人信息，以免遭受未经授杈的访问、使用或披露。
                    <br/>3.5 未经你的同意，租伴不会向歌美以外的任何公司、组织和个人披露你的个人信息，但法律法规另有规定的除外。</div>
                <div><b>四、主权利义务条款</b>
                    <br/> 4.1 帐号使用规范
                    <br/> 4.1.1 你在使用本服务前需要一个账号。添加身份信息。绑定手机号。租伴有权根据用户需求或产品需要对帐号注册和绑定的方式进行变更。
                    <br/> 4.1.2 租伴帐号的所有权归歌美（上海）企业管理有限公司所有，用户完成申请注册手续后，仅获得账户的使用权，且该使用权仅属于初始申请注册人。同时，初始申请注册人不得赠与、借用、租用、转让或售卖租伴账户或者以其他方式许可非初始申请注册人使用微信帐号。非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用租伴账户。
                    <br/> 4.1.3 用户有责任妥善保管注册帐户信息及帐户密码的安全，用户需要对注册帐户以及密码下的行为承担法律责任。用户同意在任何情况下不向他人透露帐户及密码信息。当在你怀疑他人在使用你的帐户时，你应立即通知歌美公司。
                    <br/> 4.2 用户注意事项
                    <br/> 4.2.1 你理解并同意：为了向你提供有效的服务，本软件会利用你终端设备的处理器和带宽等资源。本平台使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。
                    <br/> 4.2.2 你理解并同意：本软件的某些功能可能会让第三方知哓用户的信息，例如：用户的雇主可以查询用户照片、昵称、微信号或所在地区内容等可公开的个人资料；用户关注租伴后将成为租伴关注用户，租伴可以根据其功能权限获取关注用户头像、名字、微信号、消 息评论内容、图片、视频等信息，并可通过微信公众平台发送消息与关注用户进行互动。关注用户的消息评论内容、向公众帐号上传的图片、视频都可以被具备相应功能权限的微信公众帐号发布在公众帐号内，供第三方查阅。
                    <br/> 4.2.3 你在使平台软件某一特定服务时，该服务可能会另有单独的协议、相关业务规则等(以下统称为"单独协议"），你在使用该项服务前请阅读并同意相关的单独协议。
                    <br/> 4.2.4 你理解并同意租伴将会尽其商业上的合理努力保障你服务中的数据存储安全，但是，租伴并不能就此提供完全保证，包括但不限于以下情形：
                    <br/>4.2.4.2.1 租伴不对你在本软件及服务中相关数据的删除或储存失败负责；
                    <br/> 4.2.4.2 租伴有杈根据实际情况自行决定单个用户在本软件及服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。你可根据自己的需要自行备份本软件及服务中的相关数据；
                    <br/> 4.2.4.3 如果你停止使用本平台及服务或服务被终止或取消，歌美可以从服务器上永久地删除你的数据。服务停止、终止或取消后，租伴没有义务向你返还任何数据。
                    <br/>4.2.5 用户在使用本平台及服务时，须自行承担如下不可掌控的风险内容，包括但不限于：
                    <br/>4.2.5.1 由于不可抗拒因素可能引起的个人信息丟失、泄漏等风险；
                    <br/>4.2.5.2 用户在使用本平台关注访问第三方网站、公众号时，因第三方网站，公众号及相关内容所可能导致的风险，由用户自行承担；
                    <br/>4.2.5.3 由于无线网络信号不稳定、无线网络带宽小等原因，所引起的平台登录失败、资料同步不完整、页面打开速度慢等风险。
                    <div><b>五、用户行为规范</b>
                        <br/>5.1 信息内容规范
                        <br/>5.1.1 本条所述信息内容是指用户使用本平台及服务过程中所上传、复制、发布、传播的任何内容，以及在出租过程中的行为规范。包括但不限于微信帐号头像、名字、用户说明等注册信息，或文字、语音、图片等，以及其他使用微信帐号或本软件及服务所产生的内容。
                        <br/>5.1.2 你理解并同意，本平台一直致力于为用户提供文明健康、规范有序的网络环境，你不得利用帐号或本软件及服务制作、复制、发布、传播如下干扰正常运营，以及侵犯其他用户或第三方合法权益的内容，包括但不限于：
                        <br/>5.1.2.1 发布、传送、传播、储存违反国家法律法规禁止的内容：
                        <br/>(1) 违反宪法确定的基本原则的；
                        <br/>(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
                        <br/>(3) 损害国家荣誉和利益的；
                        <br/>(4) 煽动民族仇恨、民族歧视，破坏民族团结的；
                        <br/>(5) 破坏国家宗教政策，宣扬邪教和封建迷信的；
                        <br/>(6) 散布谣言，扰乱社会秩序，破坏社会稳定的；
                        <br/>(7) 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；
                        <br/>(8) 侮辱或者诽谤他人，侵害他人合法权益的；
                        <br/>(9) 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；
                        <br/>(10) 以非法民间组织名义活动的；
                        <br/>(11) 不符合《即时通信工具公众信息服务发展管理暂行规定》及遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等"七条底线"要求的；
                        <br/> (12) 含有法律、行政法规禁止的其他内容的。
                        <br/>5.1.2.2 发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；
                        <br/>5.1.2.3 涉及他人隐私、个人信息或资料的；
                        <br/> 5.1.2.4 发表、传送、传播骚扰、广告信息、过度营销信息及垃圾信息或含有任何性或性暗示的；
                        <br/>5.1.2.5 其他违反法律法规、政策及公序良俗、社会公德和侵犯其他用户或第三方合法权益内容的信息。
                        <br/>5.2 软件使用规范
                        <br/>5.2.1 除非法律允许或歌美书面许可，你使用本软件过程中不得从事下列行为：<br/>5.2.1.1删除本软件及其副本上关于著作杈的信息；
                        <br/>5.2.1.2 对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码；
                        <br/>5.2.1.3 对歌美拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
                        <br/> 5.2.1.4对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非歌美经授权的第三方工具、服务接入本软件和相关系统；
                        <br/>5.2.1.5 通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
                        <br/>5.2.1.6 通过非歌美开发、授权的第三方软件、插件、外挂、系统，登录或使用歌美软件及服务，或制作、发布、传播上述工具；
                        <br/>5.2.1.7 自行或者授杈他人、第三方软件对本软件及其组件、模块、数据进行干扰；
                        <br> 5.2.1.8 其他未经歌美明示授杈的行为。
                        <br/> 5.2.2 你理解并同意，基于用户体验、微信我读完了或相关服务平台运营安全、平台规则要求及健康发展等综合因素，歌美有权选择提供服务的对象，有权决定功能设置，有权决定功能开放、数据接口和相关数据披露的对象和范围。针对以下情形，有权视具体情况中止或终止提供本服务，包括但不限于：
                        <br/>5.2.2.1 违反法律法规或本协议规定的；
                        <br/>5.2.2.2 影响服务体验的；
                        <br/>5.2.2.3 存在安全隐患的；
                        <br/>5.3 服务运营规范除非法律允许或歌美书面许可，你使用本服务过程中不得从事下列行为：
                        <br/>5.3.1 提交、发布虚假信息，或冒充、利用他人名义的；
                        <br/> 5.3.2 诱导其他用户点击链接页面或分享信息的；
                        <br/> 5.3.3 虚构事实、隐瞒真相以误导、欺骗他人的；
                        <br/>5.3.4 侵害他人名誉杈、肖像权、知识产权、商业秘密等合法权利的；
                        <br/> 5.3.5 利用帐号或本软件及服务从事任何违法犯罪活动的；
                        <br/>5.3.6 制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；
                        <br/>5.3.7 其他违反法律法规规定、侵犯其他用户合法权益、干扰产品正常运营或歌美未明示授权的行为。
                        <br/> 5.4 对自己行为负责 你充分了解井同意，你必须为自己注册帐号下的一切行为负责，包括你所发表的任何内容以及由此产生的任何后果。你应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。歌美无法且不会对因前述风险而导致的任何损失或损害承担责任。
                        <br/>5.5 违约处理
                        <br/> 5.5.1 如果歌美发现或收到他人举报或投诉用户违反本协议约定的，歌美有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁直至注销的处罚，并公告处理结果。
                        <br/> 5.5.2 你理解并同意，歌美有权依合理判断 对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。
                        <br/> 5.5.3 你理解并同意，因你违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，你应当独立承担责任；歌美因此遭受损失的，你也应当一并赔偿。</div>
                    <div><b>六、知识产权声明（相关申请）</b>
                        <br/>6.1 歌美是本软件的知识产权权利人。本软件的一切著作权、商标杈、专利杈、商业秘密等知识产权，以及与本软件相关的所有信息内容 (包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，歌美享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。
                        <br/> 6.2 未经歌美或相关权利人书面同意，你不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。
                        <div><b>七、终端安全责任</b>
                            <br/> 7.1 你理解并同意，本平台同大多数互联网软件、平台一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境等；也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁你的终端设备信息和数据安全，继而影响本微信公众平台的正常使用等。因此，你应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。
                            <br/> 7.2 你不得制作、发布、使用、传播用于窃取平台账户及他人个人信息、财产的恶意程序。
                            <br/> 7.3 维护软件安全与正常使用是歌美和你的共同责任，歌美将按照行业标准合理审慎地采取必要技术措施保护你的终端设备信息和数据安全，但是你承认和同意歌美并不能就此提供完全保证。
                            <br/>7.4 在任何情况下，你不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意歌美有关防范诈骗犯罪的提示。
                            <div><b>八、其他</b>
                                <br/> 8.1 你使用本软件即视为你已阅读并同意受本协议的约束。租伴有权在必要时修改本协议条款。你可以在本软件的最新版本中查阅相关协议条款。本协议条款变更后，如果你继续使用本软件，即视为你已接受修改后的协议。如果你不接受修改后的协议，应当停止使用本软件。
                                <br/>8.2 本协议签订地为中华人民共和国上海市松江区。
                                <br/> 8.3 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。
                                <br/> 8.4 若你和租伴之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，你同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。
                                <br/> 8.5 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
                                <br/>8.6 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
                            </div>
                            <div class="footer">(正文完）
                                <br/>歌美（上海)企业管理有限公司</div>
                                <div style ="height:60px;"></div>
                        </div>
                        <div class="button-release" @click="agree">同意</div>
                    </div>
                </div>
                </div>
                </div>
                </div>
</template>
<script>
export default {
    components: {

    },
    data() {
        return {
            next: "registered"
        }
    },
    mounted() {
        this.next = this.$route.params.next
    },
    methods: {
        agree() {
            this.$router.push({
                path: '/'+this.next
            });
        }
    },
    destroyed() {}
}
</script>
<style lang="less" scoped>
.container-body {
    margin: 20px 20px 0px 20px;
    font-size: 14px;
    .a_default {
        color: #e2e2e2;
    }
    .button-release {
        position: fixed;
        bottom: 0;
        left: 0;
        right: 0;
        height: 50px;
        background-color: #A877E6;
        line-height: 50px;
        text-align: center;
        color: #FFFFFF;
    }
    .footer {
        text-align: right;
    }
}
</style>
